<template>
  <div class="">
    <section class="">
      <h1 class="">Идея</h1>
      <p class="">Создание образовательного портала для учеников. Таким образом мы решаем проблему с тем, что многие ученики
        попросту не могут подготовиться к поступлению в элитные школы. Подобные проекты уже имеются в Казахстане, но вся
        их проблема в неудобстве пользования, в отсутствии/неверности задач/материалов, в дороговизне подготовки или
        неудобное расположение. </p>
    </section>
    <section class="">
      <h1 class="">Описание</h1>
      <p class="">Нашей же целью было сделать портал максимально простым и удобным для учеников, т.к. мы считаем, что каждый
        ученик должен иметь возможность получить качественную подготовку, независимо от того, где он живет и в какую
        школу пойдет. Что касается материалов, то мы постарались их собрать все самое лучшее и интересное, причем мы
        ориентировались на тех учеников, которые поступают в элитные образовательные учреждения. Мы не делали портал для
        учителей, а наоборот, старались сделать его как можно более удобным именно для учеников и их родителей. В
        результате, мы рады предложить вам наш образовательный портал, который станет для вас хорошим помощником в
        подготовке к экзаменам.</p>
    </section>
    <section class="" style="">
      <h1 class="">Цель</h1>
      <p class="">Предоставить онлайн возможность ученикам подготовиться к поступлению в элитные школы, а также подтянуть свои
        знания по предоставленным на сайте предметам.</p>
    </section>
  </div>
</template>
<script>

export default {
  name: 'MainView',
  data: () => ({}),
}
</script>
<style scoped>
:root {
  --primary-color: #4861ff;
  --secondary-color: #ff7243;
  --white-color: #fffefd;
}
.wrapper {
  justify-content: center;
  align-items: center;
  display: flex;
  height: 90vh;
  flex-direction: column;
}

section.border {
  text-align: center;
  width: 80%;
  max-width: 800px;
  min-width: 450px;
  border-radius: 10rem;
  
}
section.border h1 {
  background-color: #4861ff;
  color:#fffefd;
}
</style>